# Titanic
#### from kaggle

### 1. 캐글 코드 필사

제목 : Titanic - Advanced Feature Engineering Tutorial / 저자 : GUNES EVITAN
https://www.kaggle.com/code/gunesevitan/titanic-advanced-feature-engineering-tutorial

#### 0. Introduction

In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set(style="darkgrid")

from sklearn.ensemble import RandomForestClassifier
from sklearn.preprocessing import OneHotEncoder, LabelEncoder, StandardScaler
from sklearn.metrics import roc_curve,auc
from sklearn.model_selection import StratifiedKFold

import string
import warnings
warnings.filterwarnings('ignore')

SEED = 42

In [23]:
def concat_df(train_data,test_data):
    return pd.concat([train_data,test_data],sort=True).reset_index(drop=True)

def divide_df(all_data):
    return all_data.loc[:890], all_data.loc[891:].drop(['Survived'],axis=1) # 트레인 데이터가 891개

df_train = pd.read_csv('../Origin Data/train.csv')
df_test = pd.read_csv('../Origin Data/test.csv')
df_all = concat_df(df_train,df_test)

df_train.name = 'Training Set'
df_test.name = 'Test Set'
df_all.name = 'All set'

dfs = [df_train,df_test]

print('Train 데이터 수 = {}'.format(df_train.shape[0]))
print('Test 데이터 수 = {}'.format(df_test.shape[0]))
print('Train Shape : {}'.format(df_train.shape))
print('Test Shape : {}'.format(df_test.shape))
print('Train columns : {}'.format(list(df_train.columns)))
print('Test columns : {}'.format(list(df_test.columns)))

Train 데이터 수 = 891
Test 데이터 수 = 418
Train Shape : (891, 12)
Test Shape : (418, 11)
Train columns : ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
Test columns : ['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

#### 1. EDA (Exploratory Data Analysis)

##### 1.1 Overview

- PassengerId is the unique id of the row and it doesn't have any effect on target
- Survived is the target variable we are trying to predict (0 or 1):
    - 1 = Survived
    - 0 = Not Survived
- Pclass (Passenger Class) is the socio-economic status of the passenger and it is a categorical ordinal feature which has 3 unique values (1, 2 or 3):
    - 1 = Upper Class
    - 2 = Middle Class
    - 3 = Lower Class
- Name, Sex and Age are self-explanatory
- SibSp is the total number of the passengers' siblings and spouse (배우자/형제자매)
- Parch is the total number of the passengers' parents and children
- Ticket is the ticket number of the passenger
- Fare is the passenger fare
- Cabin is the cabin number of the passenger (선실 번호)
- Embarked is port of embarkation and it is a categorical feature which has 3 unique values (C, Q or S): (승선했던 항구)
    - C = Cherbourg
    - Q = Queenstown
    - S = Southampton

In [31]:
print(df_train.info())
print(df_train[['Survived','Age','SibSp','Parch','Fare']].describe())
df_train.sample(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
         Survived         Age       SibSp       Parch        Fare
count  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838   29.699118    0.523008    0.381594   32.204208
std      0.486592   14.526497    1.102743    0.806057   49.693429
min      0.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000   80.000000    8.000000    6.000000  512.329200

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
296,297,0,3,"Hanna, Mr. Mansour",male,23.5,0,0,2693,7.2292,NaN,C
216,217,1,3,"Honkanen, Miss. Eliina",female,27.0,0,0,STON/O2. 3101283,7.9250,NaN,S
758,759,0,3,"Theobald, Mr. Thomas Leonard",male,34.0,0,0,363294,8.0500,NaN,S

In [32]:
print(df_test.info())
print(df_test[['Age','SibSp','Parch','Fare']].describe())
df_test.sample(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
None
              Age       SibSp       Parch        Fare
count  332.000000  418.000000  418.000000  417.000000
mean    30.272590    0.447368    0.392344   35.627188
std     14.181209    0.896760    0.981429   55.907576
min      0.170000    0.000000    0.000000    0.000000
25%     21.000000    0.000000    0.000000    7.895800
50%     27.000000    0.000000    0.000000   14.454200
75%     39.000000    1.000000    0.000000   31.500000
max     76.000000    8.000000    9.000000  512.329200

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
71,963,3,"Minkoff, Mr. Lazar",male,21.0,0,0,349211,7.8958,NaN,S
74,966,1,"Geiger, Miss. Amalie",female,35.0,0,0,113503,211.5000,C130,C
32,924,3,"Dean, Mrs. Bertram (Eva Georgetta Light)",female,33.0,1,2,C.A. 2315,20.5750,NaN,S

##### 1.2 Missing Values

Training set have missing values in Age, Cabin and Embarked columns  
Test set have missing values in Age, Cabin and Fare columns

In [43]:
def display_missing(df):
    for col in df.columns.tolist():
        print('{} column missing values : {}'.format(col,df[col].isnull().sum()))
    print('\n')

for df in dfs:
    print('{}'.format(df.name))
    print('data count : {}'.format(df.shape[0]))
    display_missing(df)

Training Set
data count : 891
PassengerId column missing values : 0
Survived column missing values : 0
Pclass column missing values : 0
Name column missing values : 0
Sex column missing values : 0
Age column missing values : 177
SibSp column missing values : 0
Parch column missing values : 0
Ticket column missing values : 0
Fare column missing values : 0
Cabin column missing values : 687
Embarked column missing values : 2


Test Set
data count : 418
PassengerId column missing values : 0
Pclass column missing values : 0
Name column missing values : 0
Sex column missing values : 0
Age column missing values : 86
SibSp column missing values : 0
Parch column missing values : 0
Ticket column missing values : 0
Fare column missing values : 1
Cabin column missing values : 327
Embarked column missing values : 0

1.2.1 Age

단순히 Median 값으로 나이 결측값을 채우는것보단, 나이와 높은 연관성을 가진 Pclass로 범주를 구분하여 Median 값으로 채우는것이 더 좋은 선택으로 보이므로 이를 구현해보겠습니다.

In [51]:
df_all_corr = df_all.corr().abs().unstack().sort_values(kind="quicksort",ascending = False).reset_index()
df_all_corr.rename(columns={"level_0":"Feature 1","level_1":"Feature 2",0:"Correlation Coefficient"},inplace=True)
df_all_corr[df_all_corr['Feature 1']=='Age']

   Feature 1    Feature 2  Correlation Coefficient
0        Age          Age                 1.000000
9        Age       Pclass                 0.408106
18       Age        SibSp                 0.243699
21       Age         Fare                 0.178740
26       Age        Parch                 0.150917
30       Age     Survived                 0.077221
41       Age  PassengerId                 0.028814

여기서 추가로 아래와 같이 성별도 Pclass와 함께 age에 영향을 끼치므로 Sex 도 함께 활용하여 Medain 값을 구해보겠습니다.

###### My Opinion :이런게 중요한 포인트! 
( na 값 채울때 연관성 보고 채우기 [ 이는 결측값 채울때만 쓰이는게 아니라 EDA 를 통해 인사이트를 얻어 어떤걸 처리할때 필요한 항목! ] )

In [52]:
age_by_pclass_sex = df_all.groupby(['Sex','Pclass']).median()['Age']
age_by_pclass_sex

Sex     Pclass
female  1         36.0
        2         28.0
        3         22.0
male    1         42.0
        2         29.5
        3         25.0
Name: Age, dtype: float64

In [54]:
df_all.groupby(['Sex','Pclass'])['Age'].apply(lambda x : x.fillna(x.median()))

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
        ...
1304    25.0
1305    39.0
1306    38.5
1307    25.0
1308    25.0
Name: Age, Length: 1309, dtype: float64

## Q. 이거 이해가 안됨!! 
groupby 를 통해서 grouped 된 상태인데 어떻게 이렇게 나올 수 있지?

In [56]:
df_all['Age']= df_all.groupby(['Sex','Pclass'])['Age'].apply(lambda x : x.fillna(x.median()))

1.2.2 Embarked

승선한 항구의 정보가 결측값인건 두개 뿐이다. 아래 두개의 정보를 보면 둘다 여자고 1 Pclass 이며, 같은 티켓번호를 가지고있다.  
그러므로 서로 아는 사이이며 같은 항구에서 탔다고 유추해볼 수 있다.

###### My Opinion : 이렇게 생각보다 가진 정보로 유추해볼수 있는 정보는 꽤나 많다. 이런 유추(인사이트)를 잘 얻는것이 중요함!

In [59]:
df_all[df_all['Embarked'].isnull()]

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
61,38.0,B28,NaN,80.0,"Icard, Miss. Amelie",0,62,1,female,0,1.0,113572
829,62.0,B28,NaN,80.0,"Stone, Mrs. George Nelson (Martha Evelyn)",0,830,1,female,0,1.0,113572

구글에 이름을 검색해보니 두명 다 S(Southampton) 에서 탄것이 확인된다.

In [60]:
df_all['Embarked'] = df_all['Embarked'].fillna('S')

1.2.3 Fare

요금 결측값은 전체 데이터에 하나뿐이다, 요금은 아무래도 가족 사이즈 (Parch and SibSp), Pclass와 연관이 있을것 같다. cor 로 봐도 어느정도 연관 있다고 볼 수 있다.

In [61]:
df_all[df_all['Fare'].isnull()]

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
1043,60.5,NaN,S,NaN,"Storey, Mr. Thomas",0,1044,3,male,0,NaN,3701

In [74]:
df_all_corr=df_all.corr().abs().unstack().sort_values(ascending=False).reset_index()
df_all_corr[df_all_corr['level_0']=='Fare']

   level_0      level_1         0
1     Fare         Fare  1.000000
8     Fare       Pclass  0.558629
16    Fare     Survived  0.257307
18    Fare        Parch  0.221539
22    Fare          Age  0.200039
23    Fare        SibSp  0.160238
40    Fare  PassengerId  0.031428

In [79]:
print(df_all.groupby(['Pclass','Parch','SibSp']).Fare.median())
med_fare = df_all.groupby(['Pclass','Parch','SibSp']).Fare.median()[3][0][0]
df_all['Fare'] = df_all['Fare'].fillna(med_fare)

Pclass  Parch  SibSp
1       0      0         31.33960
               1         75.25000
               2         51.47920
        1      0         63.35830
               1         83.15830
        2      0         83.15830
               1        120.00000
               2        262.37500
               3        263.00000
        3      1        262.37500
        4      1        263.00000
2       0      0         13.00000
               1         26.00000
               2         73.50000
               3         21.00000
        1      0         23.00000
               1         26.25000
               2         33.00000
        2      0         26.25000
               1         41.57920
        3      0         39.00000
               1         23.00000
               2         18.75000
3       0      0          7.85420
               1         14.45625
               2         19.83960
               3         16.92500
        1      0         12.47500
               1         15.24580
               2         19.25830
               3         22.02500
               4         34.40625
        2      0         15.24580
               1         22.01250
               2         34.37500
               3         27.90000
               4         31.27500
               5         46.90000
               8         69.55000
        3      0         19.25830
               1         34.37500
        4      0         23.27085
               1         27.90000
        5      0         34.40625
               1         31.33125
        6      1         46.90000
        9      1         69.55000
Name: Fare, dtype: float64